quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
/*
 * MAX325xx.c -- MAX32590, MAX32550 & MAX32555 Smartcard UART driver
 *
 * --------------------------------------------------------------------------
 *
 * Copyright (c) 2015, Maxim Integrated Products, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>
#include "sc_config.h"
#include "sc_errors.h"
#include "sc_types.h"
#include "sc_regs.h"
#include "OSWrapper.h"
#include "OS_types.h"
#include "slot.h"
#include "iccabstract.h"
#include "MAX325xx_uart.h"           /*uart driver header*/
#include "MAX325xx_uart_private.h"           /*uart driver header*/
#include "MAX3255x_afe.h"

/* forward declarations */
static void UartInterrupt_Handler(SlotContext_t  *SlotCtx);

/** @var    UartPrivateData
 *  @brief  UART private data (one per interface)
 */
static UartState_t UartPrivateData[] = {
    {.UartAddress = (uintptr_t) NULL},
#if defined (MAX32590)
    /* second interface for MAX32590 (aka JIBE) */
    {.UartAddress = (uintptr_t) NULL},
#endif
};

#if defined (__MAX32590)
const uintptr_t UartPhysicalAddresses[MAX325xx_INTERFACE_NUMBER] = {
    MAX32590_SC0_BASE_ADDRESS,
    MAX32590_SC1_BASE_ADDRESS,
};
#elif defined (__MAX32550) || defined(MAX32550_B1) || defined(__MAX32555)
const uintptr_t UartPhysicalAddresses[MAX325xx_INTERFACE_NUMBER] = {
    MAX3255x_SC_BASE_ADDRESS,
};
#endif

/******************************************************************************
 *   Private functions
 */
/** @fn     UartSetWaitingTime
 *  @brief  set the waiting time (in ETUs)
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] wt           requested WT
 *
 * @note this is a internal function (not accessible to the user)
 */
static void UartSetWaitingTime(UartState_t *UartState, uint32_t wt)
{
    OSWrapper_WriteReg(UartState->UartAddress + SC_WT0R, wt);
    OSWrapper_WriteReg(UartState->UartAddress + SC_WT1R, 0);
}

/** @fn                             UartActiveWait
 *  @brief                          Wait for a number of ETUs
 *  @param [in]  SlotCtx             Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in]  etus                number of ETUs to wait
 *
 * @note the active wait cannot be used during a card exchange.
 *
 */
static void UartActiveWait(SlotContext_t  *SlotCtx, uint32_t etus)
{
    SCControl_t  sccr = {.word = 0 };  /* control register value */
    SCStatus_t   scsr  = {.word = 0 };  /* status register value */
    SCIER_t      scier = {.word = 0};
    UartState_t *UartState = NULL;


    if ((NULL == SlotCtx) ||(etus == 0)) {
        return ;
    }

    UartState = (UartState_t *)(SlotCtx->UartData->PrivateData);
    if (NULL == UartState) {
        return;
    }

    /* first be sure that the interrupts sources are disabled */
    /* disable all UART interrupts, but keep the AFE interrupts*/
    OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);
    scier.word &= ~MAX325xx_UART_INTERRUPT_MASK;
    OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

    /* read the control and interrupt status registers */
    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);
    OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);

    /* stop the WT/CC counter */
    sccr.bits.WTEN  = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /*clear the WTIS Flag */
    scsr.bits.WTOV = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

    /*load the WT register with the number of ETUs */
    UartSetWaitingTime(UartState, etus);

    /*Start the WT counter */
    sccr.bits.WTEN  = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);

    /*wait until the counter expires */
    do {
         OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);
    } while ((scsr.bits.WTOV != 1) && (ICC_OK == IccCheckCardState(SlotCtx)));

    /* stop the WT counter */
    sccr.bits.WTEN  = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /*clear the WTIS Flag */
    scsr.bits.WTOV = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);
}

/** @fn     UartSetGuardTime
 *  @brief  set the guard time (in ETUs)
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *
 *  @note this is a internal function (not accessible to the user)
 */
static void UartSetGuardTime(SlotContext_t  *SlotCtx)
{
    UartState_t *UartState = NULL;

     if (NULL == SlotCtx) {
        return;
    }

