quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return;
    }

    UartState = (UartState_t *)(SlotCtx->UartData->PrivateData);
    if (NULL == UartState) {
        return;
    }

    OSWrapper_WriteReg(UartState->UartAddress + SC_GTR,
                      (uint32_t) SlotCtx->IccProtocolConfig.IccExtraGuardTime);
}

/** @fn     UartSetETU
 *  @brief  set the ETU duration
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *
 *  @note this is a internal function (not accessible to the user)
 */
static IccReturn_t UartSetETU(SlotContext_t  *SlotCtx)
{
    uint8_t  di = 0;
    uint16_t fi = 0;
    uint8_t  fidi = 0;
    UartState_t *UartState = NULL;

    if (NULL == SlotCtx) {
        return ICC_ERR_NULL_PTR;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartState = (UartState_t *)(SlotCtx->UartData->PrivateData);
    if (NULL == UartState) {
        return ICC_ERR_NULL_PTR;
    }

    fidi = SlotCtx->IccProtocolConfig.FiDi;

    di = Di[fidi & 0x0F];
    fi = Fi[fidi >> 4];

    if ((fi % di) > (di / 2)) {
        OSWrapper_WriteReg(UartState->UartAddress + SC_ETUR,
                           SCI_ETUR_COMP | (uint32_t) ((fi / di) & 0xFFFF));
    } else {
        OSWrapper_WriteReg(UartState->UartAddress + SC_ETUR,
                           (uint32_t) ((fi / di)&0xFFFF));
    }

    return ICC_OK;
}


/** @fn     UartSetConfig
 *  @brief  set the timing parameters according to the actual protocol
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *
 *  set the ETU, EGT, WT according to the #SlotContext_t and the current protocol.
 */
static IccReturn_t UartSetConfig(SlotContext_t  *SlotCtx)
{
    if (NULL == SlotCtx) {
        return ICC_ERR_NULL_PTR;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartSetETU(SlotCtx);

    UartSetGuardTime(SlotCtx);

    /*other values are dynamically set*/

    return ICC_OK;
}


/** @fn                     UartComputeEDC
 *  @brief                  Compute the EDC (LRC or CRC) of the frame
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] pData        Pointer on the Tx buffer
 *  @param [in] datalen      Length of the data to send (excluding the EDC in T=1)
 *
 *  @return                 return the LRC/CRC value
 *
 * @note No check on parameter is done !
 * @note This is an internal function  (cannot be called by the user)
 * @note CRC16 polynomial: X^12 + X^5 + 1
 */
static uint16_t UartComputeEDC(SlotContext_t  *SlotCtx,
                               uint8_t *pData, uint16_t datalen)
{
    uint16_t EDC  = 0;
    uint16_t i    = 0;
    uint16_t data = 0;

    if ((NULL == SlotCtx) || (NULL == pData)) {
        return 0;
    }

    if (SlotCtx->IccProtocolParams.IccProtocol == 0) {
        return 0;
    }

    /* Initialize EDC value */
    if (SlotCtx->IccProtocolParams.IccEDCTypeCRC == bTRUE) {
        /* CRC 16 */
        EDC = 0xFFFF;

        while (datalen--) {
            data = (uint16_t) (*pData++)<<8;

            for (i = 0; i < 8; i++) {

                if ((EDC ^ data) & 0x8000) {
                    EDC <<= 1;
                    EDC ^= 0x1021; /*0x1021 is the X^12 + X^5 + 1*/
                } else {
                    EDC <<= 1;
                }

                data <<= 1;
            }
        }
    } else {
        /*LRC */
        EDC = 0;
        for (i=0; i<datalen; i++) {
            EDC ^= *pData++;
        }
    }

    return EDC;
}

/***************************************************************************/

/** @fn UartOnCardStateChanged
 *  @brief  Notify the driver that the card status changed
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] CardState    New card state (cf #CardState_t)
 *
 *  Notify the driver that the card status changed, \n
 *  if the card has been removed or is no longer powered, the UART driver
 *  will deactivate the card and return an error code.
 */
static void  UartOnCardStateChanged(SlotContext_t  *SlotCtx, CardState_t CardState)
{
    uint8_t      AcitveSlotId = 0;

    if (NULL == SlotCtx) {
        return;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return;
    }

    /* check if we should restore the UART context */
    AcitveSlotId = ((UartState_t *)SlotCtx->UartData->PrivateData)->ActiveSlot;
    if (AcitveSlotId != SlotCtx->SlotId) {
        /* we do not care as if this is not the current slot,
         * that means that the card status will be checked when we
         * will select this slot
         */
         return;
    }

    switch (CardState) {
        case ICC_REMOVAL:
        case ICC_FAULT:
            UartStop(SlotCtx, ICC_ERR_REMOVED);
            break;

        case ICC_INSERTION:
        default:
            break;
    }

}

/** @fn     UartReceive
 *  @brief  Set the UART driver in Rx state
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] RxRequest    Rx parameters (pointer on the Rx buffer, expected length... cf #IccRequest_t)
 *  @return                 return an #IccReturn_t error code
 *  @reval     ICC_ERR_NULL_PTR if either the RxRequest pointer or the Rx buffer pointer is null
 *  @retval    ICC_OK           if everything went well.
 *
 *  Change the UART Driver state to Rx mode and set the Rx parameters according to the #IccRequest_t RxRequest
 */
static IccReturn_t UartReceive(SlotContext_t  *SlotCtx, IccRequest_t *RxRequest)
{
    SCControl_t  sccr  = { .word = 0 };   /* control register value */
    SCIER_t      scier = { .word = 0 };      /* interrupt enable register value*/
    SCISR_t      scisr = { .word = 0 };
    SCStatus_t   scsr  = { .word = 0 };  /* status register value */
    UartData_t   *UartData  = NULL;
    UartState_t  *UartState = NULL;

    if ((NULL == SlotCtx) ||
        (NULL == RxRequest) ||
        (NULL == RxRequest->IccData) ) {
        return ICC_ERR_NULL_PTR;
    }

