quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartData = ((UartData_t *)SlotCtx->UartData);
    if (NULL == UartData) {
        return ICC_ERR_NULL_PTR;
    }

    /* update the Guard Time */
    UartSetGuardTime(SlotCtx);

    /*store the pointer on the Rx Request*/
    UartState = ((UartState_t *)UartData->PrivateData);
    UartState->RxRequest = RxRequest;
    RxRequest->IccReceived = 0;
    RxRequest->IccStatus = ICC_RX_PENDING;

    if (RxRequest->IccLen == 0) {
        return ICC_ERR_WRONG_LEN;
    }

    UartState->TxData.ParityError = bFALSE;

    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);

    if (SlotCtx->IccProtocolParams.IccProtocol == 0) {
        /* T=0 Protocol
         * Enable Char repetition on parity error
         */
         sccr.bits.CREP = 1;

    } else {
        /* T=1 protocol,
         * Clear Char repetition on parity error
         * (this is managed at block level)
         */
        sccr.bits.CREP = 0;
    }
    sccr.bits.RXFLUSH = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /* clear status flags */
    scsr.word = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

    /*clear interrupt flags */
    OSWrapper_ReadReg(UartState->UartAddress + SC_ISR, &scisr.word);
    scisr.word &= ~MAX325xx_UART_INTERRUPT_MASK;
    OSWrapper_WriteReg(UartState->UartAddress + SC_ISR, scisr.word);

    /* Parity interrupt is not set during the power up sequence
     * in order to check the ATR
     */
    OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);
    if (bFALSE == SlotCtx->IsPoweringUp) {
        scier.bits.PARIE = 1;
    }
    scier.bits.WTIE  = 1;
    scier.bits.CTIE  = 1;
    scier.bits.RXTIE = 1;
    scier.bits.RXFIE = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

    return ICC_RX_PENDING;
}


/** @fn                     UartGetRxLen
 *  @brief                  return the number of received bytes
 *  @param [in] SlotCtx      Slot configuration context pointer (cf #SlotContext_t)
 *  @param [out] Status      contains an #IccReturn_t error code
 *
 *  @return                 the number of bytes received.
 */
static uint16_t UartGetRxLen(SlotContext_t  *SlotCtx, IccReturn_t *Status)
{
    uint16_t     receivedlen = 0;
    UartData_t   *UartData   = NULL;
    UartState_t  *UartState  = NULL;
    IccRequest_t *RxRequest  = NULL;

    if (NULL == SlotCtx) {
getlen_exit_ptr:
        *Status = ICC_ERR_NULL_PTR;
        return 0;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        *Status = ICC_ERR_BAD_PARAMETER;
        return 0;
    }

    UartData = ((UartData_t *)SlotCtx->UartData);
    if (NULL == UartData) {
        goto getlen_exit_ptr;
    }

    UartState = UartData->PrivateData;
    if (NULL == UartState) {
        goto getlen_exit_ptr;
    }

    RxRequest = UartState->RxRequest;
    if ((NULL == RxRequest) ||
        (NULL == RxRequest->IccData)) {
        goto getlen_exit_ptr;
    }

    receivedlen = RxRequest->IccReceived;
    *Status     = RxRequest->IccStatus;

    return receivedlen;

}


/** @fn     UartSend
 *  @brief  Send a buffer to the card
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] pData        Pointer on the Tx buffer
 *  @param [in] datalen      Length of the data to send (excluding the EDC in T=1)
 *
 *  @return                 return an #IccReturn_t error code
 *  @reval     ICC_ERR_NULL_PTR     if pData pointer is null
 *  @retval    ICC_ERR_TX_UNDERRUN  if we were interrupted during the Tx and we got an underrun.
 *  @retval    ICC_OK               if everything went well.
 *
 * Send a buffer to the card.
 * For T=1 protocol, it also append the EDC (CRC16 or LRC8) to the frame.
 */
static IccReturn_t UartSend(SlotContext_t  *SlotCtx, uint8_t *pData, uint16_t datalen)
{
    uint16_t    EDC    = 0;
    SCISR_t     scisr  = {.word = 0}; /* interrupt status register value */
    SCControl_t sccr   = {.word = 0};  /* control register value */
    SCStatus_t  scsr   = {.word = 0};  /* status register value */
    SCIER_t     scier  = {.word = 0};
    UartState_t *UartState = NULL;
    IccReturn_t retval     = ICC_OK;

    if ((NULL == SlotCtx) ||
        (NULL == pData)    )
        return ICC_ERR_NULL_PTR;

    if (datalen == 0) {
        return ICC_ERR_WRONG_LEN;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartState = (UartState_t *)(SlotCtx->UartData->PrivateData);
    if (NULL == UartState) {
        return ICC_ERR_NULL_PTR;
    }

    /* update the ETU duration and Guard Time */
    UartSetConfig(SlotCtx);

    /* PreCompute the LRC or CRC */
    EDC = UartComputeEDC(SlotCtx, pData, datalen);

    /* firstly we must wait the end of the BGT + 10 arbitrary ETUs
     * these extra ETUs are MANDATORY for the Micropross 3150 tool to correctly
     * run the EMV campaign
     */
    UartActiveWait(SlotCtx, SlotCtx->IccProtocolConfig.IccBlockGuardTime + 10);

    /* stop the WT counter */
    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);
    sccr.bits.WTEN = bFALSE;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    if (SlotCtx->IccProtocolParams.IccProtocol == 0) {
        /* With T=0 we set the Work Waiting time value
         * This is the maximum time allowed to the card to answer
         * it starts on the last sent byte rising edge
         */
        sccr.bits.CREP = 1;
    } else {
        /* in T=1 we set the Block waiting time, this is the maximum time
         * between the last character we sent and the first start bit of the
         * block from the card
         */
        sccr.bits.CREP = 0;
    }

    /* set the BWT or the WWT (both are stored in the same variable)
     * Note: + 10 etus when a packet is received, the interrupt occurs
     * on the stop bit (which is 10 bits after the start bit)
     */
    UartSetWaitingTime(UartState, SlotCtx->IccProtocolConfig.IccWaitingTime + 10);

    /*just to be sure, reload the Guard Time register with the CGT*/
    UartSetGuardTime(SlotCtx);

    /* flush the Tx Fifo*/
    sccr.bits.TXFLUSH = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /* clear all pending status flags */
    scsr.word = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

