quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
    /*clear the Interrupt Status Flags */
    scisr.word = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_ISR, scisr.word);

    /* enable interrupts on parity error and FIFO empty*/
    scier.bits.PARIE = 1;
    scier.bits.TXEIE = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

    UartState->TxData.TransmissionComplete  = bFALSE;
    UartState->TxData.ParityError           = bFALSE;
    UartState->TxData.datalen               = datalen-1;
    UartState->TxData.pdata                 = pData;
    UartState->TxData.EDC                   = EDC;
    UartState->TxData.EDCSent               = bFALSE;

    /* now fill the TX Fifo (only the first byte)*/
    OSWrapper_WriteReg(UartState->UartAddress + SC_TXR,
                       *UartState->TxData.pdata++);


    /*
     * wait until the fifo is empty
     * (and no parity issue occured)
     *
     * here we use the TX Fifo Empty interrupt (TXEIE),
     * when the TXEIE fires, we request the interrupt for the TX complete
     * (which will be fired when the last byte will be sent)
     */
        /*wait until the transmission is completed */
    while ((bFALSE == UartState->TxData.TransmissionComplete) &&
           (bFALSE == UartState->TxData.ParityError)) {
        OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);
    }

    /* disable all smartcard interrupts */
    scier.word = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

    /*clear the Status Flags */
    scsr.word = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

    if (bTRUE == UartState->TxData.ParityError) {
        retval =  ICC_ERR_PARITY;
        goto send_exit;
    }

    sccr.bits.WTEN = 1;
    /*Start the WT counter (WWT / BWT) */
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

send_exit:
    return retval;
}


/** @fn     UartStop
 *  @brief  Stop the UART Rx process and set the IccStatus value
 *  @param [in] SlotCtx     Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in] status       The Rx status
 *
 */
static void UartStop(SlotContext_t  *SlotCtx, IccReturn_t status)
{
    SCIER_t       scier = {.word = 0};
    SCControl_t   sccr  = {.word = 0};
    SCStatus_t    scsr  = {.word = 0 };  /* status register value */
    UartData_t   *UartData = NULL;
    IccRequest_t *RxRequest = NULL;
    UartState_t  *UartState = NULL;

    if (NULL == SlotCtx) {
        return;
    }

    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        return;
    }

    UartData = ((UartData_t *)SlotCtx->UartData);
    if (NULL == UartData)  {
        return;
    }

    UartState = UartData->PrivateData;
    if (NULL == UartState) {
        return;
    }

    RxRequest = UartState->RxRequest;
    if ((NULL == RxRequest) ||
        (NULL == RxRequest->IccData)) {
        return ;
    }

    if (((UartState_t *)UartData->PrivateData)->ActiveSlot != SlotCtx->SlotId) {
        /* we are requested to stop for an other (non active) slot,
         * just ignore !
         */
         return;
    }

    /*
     * first disable the interrupts
     * disable all UART interrupts, but keep the AFE interrupts
     */
    OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);
    scier.word &= ~MAX325xx_UART_INTERRUPT_MASK;
    OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);
    sccr.bits.WTEN    = 0; /* Stop the Waiting time counter */
    sccr.bits.CCEN    = 0; /* Stop the Cycle Counter */
    sccr.bits.TXFLUSH = 1;
    sccr.bits.RXFLUSH = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /* read the status register */
    OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);

    if ((bTRUE == scsr.bits.PAR) &&
        (SlotCtx->IccProtocolParams.IccProtocol == 0)) {
        /*
         * We are using T=0, if the parity status flag is set,
         * that means that we received 5 bugged bytes.
         *
         * Here, we disable the UART then we deactivate the card using the
         * ICC abstraction layer in order to respect deactivation timings.
         */
        sccr.bits.UART = 0;
        OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

        /*
         * Deactivate the card without any delay
         * (to avoid a retry from the card)
         */
        IccPowerOff(SlotCtx);

        OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);
        sccr.bits.UART = 1;
        OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);
    }

    /* clear pending parity status flag (applicable to T=1 and T=0) */
    scsr.bits.PAR = 0;
    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

    RxRequest->IccStatus = status;

    if ((SlotCtx->IccProtocolParams.IccProtocol == 1) && (ICC_OK == status)) {

        /* compute the EDC (LRC or CRC) */
        if (SlotCtx->IccProtocolParams.IccEDCTypeCRC == bTRUE) {
            /*
             * when using the CRC16, we compute the CRC value from the
             * NAD to the last payload byte.
             */
            RxRequest->IccEDC = UartComputeEDC(SlotCtx,
                                               RxRequest->IccData,
                                               RxRequest->IccReceived-2);
        } else {
            /*
             * when using a LRC, we compute the LRC on all the bytes
             * thus, the computed value must be 0x00
             */
            RxRequest->IccEDC = UartComputeEDC(SlotCtx,
                                               RxRequest->IccData,
                                               RxRequest->IccReceived);
        }
    }
}

/** @fn     UartInterrupt_Handler
 *  @brief  Manage Uart Interrupts
 *
 */
static void UartInterrupt_Handler(SlotContext_t  *SlotCtx)
{
    SCISR_t         Status  =   {.word = 0};
    SCControl_t     sccr    =   {.word = 0};
    SCStatus_t      scsr    =   {.word = 0};
    SCCCR_t         sc_ccr  =   {.word = 0};
    SCEtu_t         sc_etu  =   {.word = 0};
    SCIER_t         scier   =   {.word = 0};
    UartData_t      *UartData  = NULL;
    UartState_t     *UartState = NULL;
    IccRequest_t    *RxRequest = NULL;

    if (NULL == SlotCtx) {
        UartStop(SlotCtx, ICC_ERR_NULL_PTR);
        goto handler_err_exit ;
    }

