quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
    if (SlotCtx->UartId >= MAX325xx_INTERFACE_NUMBER) {
        UartStop(SlotCtx, ICC_ERR_BAD_PARAMETER);
        goto handler_err_exit ;
    }

    UartData = SlotCtx->UartData;
    if (NULL == UartData)  {
        UartStop(SlotCtx, ICC_ERR_NULL_PTR);
        goto handler_err_exit ;
    }

    UartState = (UartState_t *)(UartData->PrivateData);
    if (NULL == UartState) {
        UartStop(SlotCtx, ICC_ERR_NULL_PTR);
        goto handler_err_exit ;
    }

    /* read the Interrupt flags */
    OSWrapper_ReadReg(UartState->UartAddress + SC_ISR, &Status.word);

    /* read the interrupt enable register */
    OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);

    /* read the Control Register */
    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);

    if (bTRUE == Status.bits.RXTIS) {
        /* we received something */

        /* The interrupt is about the RX */
        RxRequest = UartState->RxRequest;
        if ((NULL == RxRequest) ||
            (NULL == RxRequest->IccData)) {
            UartStop(SlotCtx, ICC_ERR_NULL_PTR);
            /* go to the handler exit (not the handler_err_exit)
             * in order to re-enable the interrupts
             */
            goto handler_exit ;
        }
        /*at least one byte has been received */
        do {
            SCRx_t  scrxr; /* Rx register */

            /* read a byte from the FIFO */
            OSWrapper_ReadReg(UartState->UartAddress + SC_RXR, &scrxr.word);

            if (bTRUE ==  SlotCtx->IsPoweringUp) {
                RxRequest->IccReceived = 0;

                /*
                 * load the clock cycle counter with the ATR inter-byte
                 * timeout
                 */
                sccr.bits.CCEN = 0;
                OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);
                OSWrapper_ReadReg(UartState->UartAddress + SC_ETUR, &sc_etu.word);

                /* as the TS has been received, set the ATR timeout */
                sc_ccr.bits.MAN = 1;
                sc_ccr.bits.CCYC =  SlotCtx->IccProtocolConfig.IccWaitingTime * sc_etu.bits.ETU;
                OSWrapper_WriteReg(UartState->UartAddress + SC_CCR, sc_ccr.word);

                /* store the received byte in the user buffer */
                RxRequest->IccData[RxRequest->IccReceived] = scrxr.bits.DATA;

                /* check the TS byte value */
                if (RxRequest->IccData[RxRequest->IccReceived]  == 0x03) {

                    if (bFALSE == Status.bits.PARIS) {
                        /*
                         * with inverse convention, we expect
                         * a parity error on the first received
                         * byte (TS)
                         */
                        UartStop(SlotCtx, ICC_ERR_PARITY);
                        goto handler_exit;
                    }

                    /*clear the Parity bit status*/
                    Status.bits.PARIS = 0;
                    OSWrapper_WriteReg(UartState->UartAddress + SC_ISR,
                                        Status.word);

                    OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);
                    scsr.bits.PAR = 0;
                    OSWrapper_WriteReg(UartState->UartAddress + SC_SR, scsr.word);

                    /* inverse convention detected */
                    sccr.bits.CONV = 1;
                    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

                    SlotCtx->IccProtocolConfig.InverseConvention = bTRUE;

                    /* force the TS value to 3F */
                    RxRequest->IccData[RxRequest->IccReceived] = 0x3F;
                } else {
                    if (RxRequest->IccData[RxRequest->IccReceived] != 0x3B) {
                         /* we are in direct convention but
                          * the TS byte is not 3B--> error !
                          */
                        UartStop(SlotCtx, ICC_ERR_BAD_ATR_VALUE);
                        goto handler_exit;
                    }

                    if (bTRUE == Status.bits.PARIS) {
                        /* with direct convention, we expect no
                         * parity error on the TS byte
                         */
                        UartStop(SlotCtx, ICC_ERR_PARITY);
                        goto handler_exit;
                    }
                }

                /*
                 * now the TS byte has been received,
                 * enable the Parity Error Interrupt
                 * and start the ATR Timeout counter
                 */
                OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);
                scier.bits.PARIE = 1;
                OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

                /*
                 * Start the WT counter (the value has been set in the
                 * UartActivate function, it contains the ATR Timeout
                 * value [from TS to the TCK])
                 */
                sccr.bits.WTEN = 1;
                sccr.bits.CCEN = 1; /* next byte timeout (auto reload) */
                OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

                /*
                 * we got the first byte, we are no more in the
                 * Powering up sate
                 */
                SlotCtx->IsPoweringUp = bFALSE;

            } else {
                /* we are not powering up the card,
                 * ie we are not receiving the ATR.
                 * So, just store in the user buffer
                 */
                RxRequest->IccData[RxRequest->IccReceived] = scrxr.bits.DATA;
            }

            /* update length values */
            RxRequest->IccReceived ++;
            RxRequest->IccLen --;

            /*
             * Read the Status Register value
             * This must be done just before the end of the while loop
             * to get the most recent value of RXELT counter
             */
            OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);

