quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
        } while ((scsr.bits.RXELT != 0) && (RxRequest->IccLen));

        if (RxRequest->IccLen == 0) {
            /* we have done  */
            RxRequest->IccLastByte = bTRUE;

            /* update the IccStatus and compute the EDC */
            UartStop(SlotCtx, ICC_OK);

        } else if ((SlotCtx->IccProtocolParams.IccProtocol == 1) &&
                   (RxRequest->IccReceived == 1)) {
            /*no need to stop the counter */

            /* set the Char Waiting Time (CWT) */
            UartSetWaitingTime(UartState,
                           SlotCtx->IccProtocolConfig.IccCharWaitingTime);

            /*Start the CWT counter */
            sccr.bits.WTEN = 1;
            OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);
        }
    } else  if ((bTRUE == Status.bits.WTIS) || (bTRUE == Status.bits.CTIS))  {
        /*if we did not received the byt but we got a timeout condition */
        /*
         * TIMEOUT during
         * - either the ATR.TS byte or
         * - or inter bytes
         * - or WWT/BWT
         * disable Rx interrupts and exit
         */
        UartStop(SlotCtx, ICC_ERR_TIMEOUT);
        goto handler_exit;
    }

    if (bTRUE == Status.bits.PARIS) {

        /*
         * as in case of Tx parity error, we will reset the UART,
         * we cannot use the SC_SR register to read the parity error bit
         */
        UartState->TxData.ParityError = bTRUE;
        OSWrapper_ReadReg(UartState->UartAddress + SC_IER, &scier.word);
        if (bFALSE == scier.bits.WTIE) {
            /* we were sending data when the parity error occured */
            /*
             * For MAX32550 A3 / MAX32555 A1 / MAX32590 B5,
             * we must disable the uart to stop the transmission
             * otherwise, the UART continues to send the byte even after
             * 5 tries.
             *
             * Here, we disable the UART then we deactivate the card using the
             * ICC abstraction layer in order to respect deactivation timings.
             */
            OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);
            sccr.bits.UART = 0;
            /* flush the Tx Fifo*/
            sccr.bits.TXFLUSH = 1;
            OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

            /* disable all smartcard interrupts */
            scier.word = 0;
            OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);

            /* Deactivate the card */
            UartActiveWait(SlotCtx, SlotCtx->IccProtocolConfig.IccCharWaitingTime);
            IccPowerOff(SlotCtx);

            OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);

            /* go back to the Smartcard UART mode */
            sccr.bits.UART = 1;
            OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);
        } else {

            /*
             * Parity error during data RX
             * depending on the protocol it could be an unrecoverable issue
             *
             * Anyway, we report the issue, the upper layer will act depending
             * what is the protocol.
             */
            UartStop(SlotCtx, ICC_ERR_PARITY);
        }
        goto handler_exit;
    }

    /* check if it's a transmission interrupt */
    if (bTRUE == Status.bits.TXEIS) {
        /*
         * the FIFO is now empty,
         */
        if (UartState->TxData.datalen) {

            do {
                OSWrapper_WriteReg_nodelay(UartState->UartAddress + SC_TXR,
                                           *UartState->TxData.pdata++);
                UartState->TxData.datalen--;
                OSWrapper_ReadReg(UartState->UartAddress + SC_SR, &scsr.word);
            } while (UartState->TxData.datalen &&
                    (scsr.bits.TXELT < MAX_TXFIFO_ELT));
        } else {
            /* no more data to send
             * just add the EDC for T=1 protocol
             */
            if ((SlotCtx->IccProtocolParams.IccProtocol == 1) &&
                (bFALSE == UartState->TxData.EDCSent)) {
                UartState->TxData.EDCSent = bTRUE;

                if (bTRUE == SlotCtx->IccProtocolParams.IccEDCTypeCRC) {
                    OSWrapper_WriteReg_nodelay(UartState->UartAddress + SC_TXR,
                                               UartState->TxData.EDC>>8);
                }

                OSWrapper_WriteReg_nodelay(UartState->UartAddress + SC_TXR,
                                               UartState->TxData.EDC&0xFF);
            } else {
                /* wait for the last byte complete flag */
                scier.bits.TCIE  = 1;
                OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);
            }
        }
    } else if (bTRUE == Status.bits.TCIS) {
        /* we sent the last byte */
        scier.bits.TCIE = 0;
        OSWrapper_WriteReg(UartState->UartAddress + SC_IER, scier.word);
        UartState->TxData.TransmissionComplete = bTRUE;
        goto handler_exit;
    }

    if (bTRUE == Status.bits.RXFIS) {
        /* Rx fifo full (overrun !)
         * No need to continue to receive data,
         * we know that we already missed at least a byte !
         */
        UartStop(SlotCtx, ICC_ERR_RX_OVERRUN);
        goto handler_exit;
    }

handler_exit:
    /* clear the interupt flags */
    /*keep only flags related to the uart (not the PHY)*/
    Status.word &= ~MAX325xx_UART_INTERRUPT_MASK;
    OSWrapper_WriteReg(UartState->UartAddress + SC_ISR, Status.word);

handler_err_exit:
    return ;
}


/** @fn                             UartActivate
 *  @brief                          Start the card activation
 *  @param [in]  SlotCtx            Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in]  ActivationParams   pointer on the activation timings (cf #ActivationParams_t)
 *
 *  @return    return an #IccReturn_t error code
 *  @reval     ICC_ERR_NULL_PTR     if pData pointer is null
 *  @retval    ICC_OK               if everything went well.
 *
 *  This function set the Icc voltage, powers it up and release the
 *  RST signal after an user defined number of ETUs.
 *
 */
static IccReturn_t  UartActivate(SlotContext_t  *SlotCtx,
                          ActivationParams_t *ActivationParams,
                          IccRequest_t *RxRequest)
{
    SCControl_t     sccr       = {.word = 0};  /* control register value */
    SCEtu_t         sc_etu     = {.word = 0};
    SCCCR_t         ATRTimeout = {.word = 0};
    UartState_t     *UartState = NULL;
    IccReturn_t     retval     = ICC_OK;

    if (NULL == SlotCtx) {
        return ICC_ERR_NULL_PTR;
    }

