quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
    if (SlotCtx->SlotId >= MAX3255x_SLOT_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartState = (UartState_t *)(SlotCtx->UartData->PrivateData);
    if (NULL == UartState) {
        return ICC_ERR_NULL_PTR;
    }


    /* update the ETU duration and Guard Time */
    UartSetConfig(SlotCtx);


    /* wait 12 etus before starting */
    UartActiveWait(SlotCtx, 12);

    retval = IccCheckCardState(SlotCtx);
    if (bTRUE == ActivationParams->IccWarmReset) {
        if (ICC_OK != retval) {
            /* the user requests a warm reset but the card is
             * either not present or not powered
             */
            return retval;
        }
    } else {
        /* set the voltage only if the card is powered off
         * (otherwise it's a manual reset release)
         */
        if (ICC_OK != retval) {
            /*
             * set the card voltage
             * note : this has no effect if the card is already powered
             * (warm reset case)
             */
            IccSetAfeVoltage(SlotCtx, ActivationParams->IccVCC);

            /*
             * Power up the card
             * note : this has no effect if the card is already powered
             * (warm reset case)
             */
            IccPowerAfe(SlotCtx, POWER_UP);
        }
    }

    /*
     * use the IsPoweringUp bit for the TS byte check during
     * the Rx handler
     */
    SlotCtx->IsPoweringUp = bTRUE;

    /*reset the card */
    IccPowerAfe(SlotCtx, RESET_DO);

    /*wait 40000 cycles (approx. 110 etus) */
    UartActiveWait(SlotCtx, ActivationParams->IccResetDuration);

    /* prepare to receive */
    UartReceive(SlotCtx, RxRequest);

    /* load the TS timeout
     * the TS timeout is the user defined value + a byte delay (10 etus)
     * (we get the interrupt on the Stop bit when the TS timeout is given
     * from the activation to the start bit
     */
    OSWrapper_ReadReg(UartState->UartAddress + SC_ETUR, &sc_etu.word);
    ATRTimeout.bits.MAN = 1;
    ATRTimeout.bits.CCYC  =  (ActivationParams->IccTS_Timeout +10);
    ATRTimeout.bits.CCYC *=  sc_etu.bits.ETU;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CCR, ATRTimeout.word);

    /* get the Control register value */
    OSWrapper_ReadReg(UartState->UartAddress + SC_CR, &sccr.word);

    /* disable char repetition and counters */
    sccr.bits.WTEN  = 0;
    sccr.bits.CCEN  = 0;
    sccr.bits.CREP  = 0;

    /*
     * For the ATR receiption, we are normally in direct
     * convetion mode, but the user can tweak this...
     * (at his own risks)
     */
    if (bTRUE == SlotCtx->IccProtocolConfig.InverseConvention) {
        /* set inverse convention */
        sccr.bits.CONV = 1;
    } else {
        sccr.bits.CONV = 0;
    }

    /* set the configuration */
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    /*
     * set the Waiting time for each byte
     * adds 10 bits as we can only get interrupts on the stop bit (which is
     * 10 etus after the start bit
     */
    UartSetWaitingTime(UartState, SlotCtx->IccProtocolConfig.IccWaitingTime + 10);

    /*we use the WT as a temporary variable (this will be set
     * once the ATR will be analyzed)
     */
    SlotCtx->IccProtocolConfig.IccWaitingTime = ActivationParams->IccATR_Timeout;

    /* adds 10 bits as we can only get interrupts on the stop bit (which is
     * 10 etus after the start bit
     */
    SlotCtx->IccProtocolConfig.IccWaitingTime += 10;

    /*
     * Note: CTIS, WTIS, PARIS, RTIS Interrupt Flags have been cleared by
     * the UartReceive function
     */

    /* release the reset */
    IccPowerAfe(SlotCtx, RESET_RELEASE);

    /*Start the Clock Cycle counter */
    sccr.bits.CCEN  = 1;
    OSWrapper_WriteReg(UartState->UartAddress + SC_CR, sccr.word);

    return ICC_OK;
}

/** @fn                     UartIoctl
 *  @brief                  process Uart interface related IOCTL
 *  @param [in]  SlotCtx    Slot configuration context pointer (cf #SlotContext_t)
 *  @param [in]  command    IOCTL request (see #sc_ioctl_t)
 *  @param [in]  value      IOCTL parameter.
 *
 *  Initialize the UART driver.\n
 *
 *  @retval    ICC_OK                   if the driver has been registered
 *  @retval    ICC_ERR_BAD_PARAMETER    if the Interface id (uart id) is out of range
 *  @retval    ICC_ERR_NULL_PTR         if we did not get the virtual address
 *
 * @note This function is not used on bare metal. (it is kept for code
 *       compatibility with the Linux version)
 */
IccReturn_t UartIoctl(SlotContext_t  *SlotCtx, sc_ioctl_t command, uint32_t value)
{
        IccReturn_t ret = ICC_OK;
        SCPin_t     scpin= {.word = 0}; /* pin setting register value */
        UartState_t *UartState = NULL;

        UartState = (UartState_t *)SlotCtx->UartData->PrivateData;

        if ((NULL == UartState) || (NULL == (void*)UartState->UartAddress))
                return ICC_ERR_NULL_PTR;


        switch (command) {
        case IOCTL_CARD_RESET:
                OSWrapper_ReadReg(UartState->UartAddress + SC_PN,
                                 &scpin.word);

                scpin.bits.CRDRST = !!value;

                OSWrapper_WriteReg(UartState->UartAddress + SC_PN, scpin.word);
        break;

        default:
                ret = ICC_ERR_BAD_PARAMETER;
        break;
        }

        return ret;

}


/** @var    MAX325xx_UART_ops
 *  @brief  UART supported operations
 *
 *  This structure contains pointer on the supported operations.\n
 *  this will be registered in the driver in order to access to the
 *  UART operations.
 */
static const UartOps_t   MAX325xx_UART_ops = {
    .activate    = UartActivate,
    .oncardevent = UartOnCardStateChanged,
    .receive     = UartReceive,
    .getrxlen    = UartGetRxLen,
    .send        = UartSend,
    .stop        = UartStop,
    .wait        = UartActiveWait,
    .ioctl       = UartIoctl,
};

