quanguoheme/hdx_1.1/drivers/max3255X/source/sci/uart/MAX325xx_UART.c
/** @fn                     UartInit
 *  @brief                  Initialize the UART driver
 *  @param [in] UartId_t    Interface number (cf #UartId_t)
 *  @param [in]  SlotCtx    Slot configuration context pointer (cf #SlotContext_t)
 *
 *  Initialize the UART driver.\n
 *
 *  @retval    ICC_OK                   if the driver has been registered
 *  @retval    ICC_ERR_BAD_PARAMETER    if the Interface id (uart id) is out of range
 *  @retval    ICC_ERR_NULL_PTR         if we did not get the virtual address
 *
 * @note On non-Linux plateforms, this must be called during the Stack initialization.
 * @note the GPIOs must be configured as Alternate function by the caller (OS-Dependant task)
 * @note the GCR.SCCK must be configured by the caller.
 */
IccReturn_t UartInit(UartId_t id, SlotContext_t  *SlotCtx)
{
    SCControl_t sccr = {.word = 0};  /* control register value */
    SCPin_t     scpin= {.word = 0}; /* pin setting register value */
    SCISR_t     scisr= {.word = 0}; /* interrupt status register value */

    if (id >= MAX325xx_INTERFACE_NUMBER) {
        return ICC_ERR_BAD_PARAMETER;
    }

    UartPrivateData[id].UartAddress = OSWrapper_Map(UartPhysicalAddresses[id]);

    if (NULL == (void *)UartPrivateData[id].UartAddress) {
        return ICC_ERR_NULL_PTR;
    }

    /* flush fifos
     * set the UART mode
     * set the convention to default (direct convention)
     * Set the RX Threshold to 1 byte
     */
     sccr.bits.UART    = 1;
     sccr.bits.WTEN    = 0;
     sccr.bits.CCEN    = 0;
     sccr.bits.CONV    = 0;
     sccr.bits.TXFLUSH = 1;
     sccr.bits.RXFLUSH = 1;
     sccr.bits.RXTHD   = 1; /*receive FIFO threshold */
     sccr.bits.TXTHD   = MAX_TXFIFO_ELT-1; /*transmit FIFO depth (not threshold !)*/
		
     OSWrapper_WriteReg(UartPrivateData[id].UartAddress + SC_CR, sccr.word);

     /* Set the default ETU value (372 Clock Cycles)*/
     OSWrapper_WriteReg(UartPrivateData[id].UartAddress + SC_ETUR, Fi[1]/Di[1]);

    /* configure the UART I/Os (C4/C8 high, Clock enabled, IO enabled) */
    scpin.bits.CLKSEL = 1;
    scpin.bits.CRDC8  = 1;
    scpin.bits.CRDC4  = 1;
    scpin.bits.CRDIO  = 1;
    OSWrapper_WriteReg(UartPrivateData[id].UartAddress + SC_PN, scpin.word);

    /*clear all pending interrupt flags*/
    scisr.word = 0;
    OSWrapper_WriteReg(UartPrivateData[id].UartAddress + SC_ISR, scisr.word);

    if (ICC_OK != IccUartRegister(id, (UartOps_t *)&MAX325xx_UART_ops,
                                  &UartPrivateData[id])) {
        return ICC_ERR_NULL_PTR;
     }

     /* register the Handler for our UART */
     OSWrapper_RegisterIRQ(SlotCtx->UartId, UartInterrupt_Handler,
                          SlotCtx, bFALSE);

     return ICC_OK;
}
